hw4/app/controllers/movies_controller.rb

SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]
---
  def findwithsamedirector
    @movie = Movie.find(params[:id])
    begin
    	@similarmovies = Movie.findwithsamedirector(params[:id])